controllers/CitaController.php

    public function actionCreate()
    {
        $model = new Cita;
        //Instanciar automaticamente el id de empresa dependiendo el usuario
        $data['Cita'] = Yii::$app->request->post('Cita');
        $load = false;
        if($data['Cita']){
            $data['Cita']['fecha'] = $data['Cita']['horario'];
            if($this->isRol('secretaria'))
                $empresa_id = Secretaria::find()->where(['user_id' => Yii::$app->user->id])->one()->empresa_id;
            if($this->isRol('empresa'))
                $empresa_id = Empresa::find()->where(['user_id' => Yii::$app->user->id])->one()->id;
            if(!$this->isRol('admin'))
                $data['Cita']['empresa_id'] = $empresa_id;
            $load = $model->load($data);
            $model->uploadFile('documento');
        }
        if ($load && $model->save()) {
            if(is_array($data['Cita']['examenes'])){
                foreach ($data['Cita']['examenes'] as $key => $value) {
                    $citaHasExamen = new CitaHasExamen;
                    $citaHasExamen->cita_id = $model->id;
                    $citaHasExamen->examen_id = $value;
                    $citaHasExamen->save();
---
SELECT * FROM `empresa` WHERE `user_id`=27
INSERT INTO `cita` (`fecha`, `cedula`, `nombre`, `telefono`, `correo`, `cargo`, `documento`, `empresa_id`) VALUES ('2018-10-30 08:00:00', '35509892', 'cristina velasco', '350647849', 'isa@corrrea.com', 'mama', '', 5)
INSERT INTO `cita_has_examen` (`cita_id`, `examen_id`) VALUES (18, 1)

    protected function findModel($id)
    {
        if (($model = Cita::findOne($id)) !== null) {
---
SELECT * FROM `cita` WHERE `id`='18'