controllers/EmpresaController.php

    protected function findModel($id)
    {
        if (($model = Empresa::findOne($id)) !== null) {
---
SELECT * FROM `empresa` WHERE `id`='13'

    protected function findModelForm($id)
    {
        if (($model = Empresa::findOne($id)) !== null) {
---
SELECT * FROM `empresa` WHERE `id`='13'

    public function actionConfigurar($id){
        $model = $this->findModelForm($id);
        $modelEmpresa = $this->findModel($id);
        $modelConfiguracion = Configuracion::find()->where(['empresa_id' => $modelEmpresa->id])->one();
---
SELECT * FROM `configuracion` WHERE `empresa_id`=13