controllers/LinkController.php

    public function actionCreate()
    {
        $model = new Link();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `link` (`url`, `visitas`) VALUES ('http://google.com', NULL)

    protected function findModel($id)
    {
        if (($model = Link::findOne($id)) !== null) {
---
SELECT * FROM `link` WHERE `id`='1'