views/cita/_form.php

SELECT * FROM `empresa`
---
    $user_id =Yii::$app->user->id;
    if( in_array('admin', array_keys(\Yii::$app->authManager->getRolesByUser($user_id))) ){
        // Solo el admin ve este campo
        echo $form->field($model, 'empresa_id')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Empresa::find()->all(), 'id', 'nombre'),
            'language' => 'es',
            'options' => ['placeholder' => 'Seleccione una empresa ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ]);