models/forms/EmpresaForm.php

    public function save(){
        if(!$this->empresa)
            return false;
        /*$empresa = new Empresa;
        if($this->id){
            //Buscar existente
            if( !($empresa = Empresa::find()->where(['id'=>$this->empresa->id])->one()) ){
                return false;
            }
        }*/
        // $empresa->setAttributes($this->getAttributes());

        if($this->empresa->save() && $this->configuracion->save()){
            // $franjas_id = FranjaHoraria::find()
            //     ->select('id')
            //     ->where(['empresa_id' => $this->id])
            //     ->asArray()->all();

            // FranjaHorariaHasDiaTurno::deleteAll(['in', 'franja_horaria_id', array_values($franjas_id)]);

            //Elimino las relaciones de franjas
            FranjaHoraria::deleteAll("empresa_id = ".$this->empresa->id);
            //Elimino las relaciones de dias
            DiaTurno::deleteAll("empresa_id = ".$this->empresa->id);
---
SELECT EXISTS(SELECT * FROM `empresa` WHERE `empresa`.`id`=13)
UPDATE `configuracion` SET `cualquier_horario`=0, `cualquier_dia`=0 WHERE `id`=1
DELETE FROM `franja_horaria` WHERE empresa_id = 13
DELETE FROM `dia_turno` WHERE empresa_id = 13

                    $diaTurno = new DiaTurno;
                    $diaTurno->dia = $dia;
                    $diaTurno->link('empresa',$this->empresa);
                    $diaTurno->save();
---
INSERT INTO `dia_turno` (`dia`, `empresa_id`) VALUES ('Lunes', 13)

                        $franjaHoraria->tiene_limpieza = isset($franja['tiene_limpieza']) ? $franja['tiene_limpieza'] : 0;
                        $franjaHoraria->tiempo_limpieza = isset($franja['tiempo_limpieza']) ? $franja['tiempo_limpieza'] : 0;

                        if($franjaHoraria->save()){
---
INSERT INTO `franja_horaria` (`empresa_id`, `desde`, `hasta`, `tiene_turnos`, `minutos_turno`, `tiene_limpieza`, `tiempo_limpieza`) VALUES (13, '10:00 AM', '10:00 PM', 1, 30, 1, 10)


                                $diaTurno = DiaTurno::find()
                                            ->joinWith(['franjaHorariaHasDiaTurnos'])
                                            // ->select(['dia_turno.*', 'franja_horaria_has_dia_turno.*'])
                                            ->where(['empresa_id'=>$this->empresa->id, 'dia'=>$dia])
---
SELECT EXISTS(SELECT * FROM `empresa` WHERE `empresa`.`id`=13)
SELECT `dia_turno`.*, `franja_horaria_has_dia_turno`.* FROM `dia_turno` LEFT JOIN `franja_horaria_has_dia_turno` ON `dia_turno`.`id` = `franja_horaria_has_dia_turno`.`dia_turno_id` WHERE ((`empresa_id`=13) AND (`dia`='Lunes')) AND (`franja_horaria_has_dia_turno`.`franja_horaria_id` IS NULL)