models/CitaSearch.php

SELECT * FROM `empresa` WHERE `user_id`=27
---
        function isRol($rol){
            $user_id =Yii::$app->user->id;
            return in_array($rol, array_keys(\Yii::$app->authManager->getRolesByUser($user_id)));
        }
        if(isRol('secretaria'))
            $empresa_id = Secretaria::find()->where(['user_id' => Yii::$app->user->id])->one()->empresa_id;
        if(isRol('empresa'))
            $empresa_id = Empresa::find()->where(['user_id' => Yii::$app->user->id])->one()->id;