models/Cita.php

SELECT * FROM `cita` WHERE `fecha`='2018-10-25 14:00:00'
---
    public function existeCita($fecha){
        return Cita::find()->where(['fecha' => date('Y-m-d H:i:s', strtotime($fecha))])->one() ? TRUE : FALSE;