models/Empresa.php

    public function getFranjas(){
        $franjasHorarias = FranjaHoraria::find()->where(['empresa_id' => $this->id])->all();
        $franjas = [];
        foreach ($franjasHorarias as $franjaHoraria) {
            $franja = [
                'desde' => $franjaHoraria->desde,
                'hasta' => $franjaHoraria->hasta,
                'tiene_turnos' => $franjaHoraria->tiene_turnos,
                'minutos_turno' => $franjaHoraria->minutos_turno,
                'cupos' => $franjaHoraria->cupos,
                'tiene_limpieza' => $franjaHoraria->tiene_limpieza,
                'tiempo_limpieza' => $franjaHoraria->tiempo_limpieza,
            ];

            $franja['dias'] = array_keys(ArrayHelper::map($franjaHoraria->getDiaTurnos()->all(), 'dia', 'dia'));
---
SELECT * FROM `franja_horaria` WHERE `empresa_id`=13
SELECT * FROM `dia_turno` WHERE 0=1