models/Turno.php

    public function getHorarios($empresa_id, $fecha){
        $dias = [
            0 => 'Domingo',
            1 => 'Lunes',
            2 => 'Martes',
            3 => 'Miercoles',
            4 => 'Jueves',
            5 => 'Viernes',
            6 => 'Sabado',
        ];
        $dia = $dias[date('w', strtotime($fecha))];
        $franjasHorarias = FranjaHoraria::find()
                            ->where(['dia_turno.dia'=> $dia, 'franja_horaria.empresa_id' => $empresa_id])
                            ->orderBy(['id'=>SORT_DESC])
                            ->joinWith(['franjaHorariaHasDiaTurnos', 'franjaHorariaHasDiaTurnos.diaTurno'])
                            ->all();
---
SELECT `franja_horaria`.* FROM `franja_horaria` LEFT JOIN `franja_horaria_has_dia_turno` ON `franja_horaria`.`id` = `franja_horaria_has_dia_turno`.`franja_horaria_id` LEFT JOIN `dia_turno` ON `franja_horaria_has_dia_turno`.`dia_turno_id` = `dia_turno`.`id` WHERE (`dia_turno`.`dia`='Sabado') AND (`franja_horaria`.`empresa_id`=20) ORDER BY `id` DESC

    public function disponible($franjaHoraria, $fecha, $empresa_id){
        if(date('Y-m-d H:i:s', strtotime($fecha)) < date('Y-m-d H:i:s'))
            return false;

        $turno = Turno::find()->where(['fecha' => date('Y-m-d H:i:s', strtotime($fecha)), 'empresa_id' => $empresa_id]);
---
SELECT EXISTS(SELECT * FROM `turno` WHERE (`fecha`='2019-02-12 13:30:00') AND (`empresa_id`=20))