models/User.php

SELECT * FROM `empresa` WHERE `usuario_id`=58
---
    public static function getLogo(){
        $user_id =Yii::$app->user->id;
        if(User::esRol('empresa')){
            return Html::img('@web/uploads/'.Empresa::find()->where(['usuario_id' => $user_id])->one()->logo, ['alt' => 'Turnos', 'class' => "img-responsive"]);

SELECT * FROM `empresa` WHERE `usuario_id`=58
---
    public static function getEmpresa(){
        $user_id =Yii::$app->user->id;
        if(User::esRol('empresa')){
            return Empresa::find()->where(['usuario_id' => $user_id])->one()->id;